ELPasEDT/src/Catalogs/НастройкиСогласованияЗаявок/НастройкиСогласованияЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиСогласованияЗаявок</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатусыЗаявок</name>
    <attributes>
      <name>НачальныйСтатус</name>
      <type>
        <types>EnumRef.СтатусыЗаявок</types>
        <types>EnumRef.СтатусыЗаявокСокращенный</types>
      </type>
    </attributes>
    <attributes>
      <name>КонечныйСтатус</name>
      <type>
        <types>EnumRef.СтатусыЗаявок</types>
        <types>EnumRef.СтатусыЗаявокСокращенный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеКатегорииВидовОборудования</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииВидовОборудования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеОрганизации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ELPasEDT/src/Catalogs/НастройкиСогласованияЗаявок/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого СтрТЧ Из Объект.СтатусыЗаявок Цикл
		ЗполнитьТипСтатусаЗаявок(СтрТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	Объект.Наименование = Объект.Пользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыЗаявокНачальныйСтатусПриИзменении(Элемент)
	
	ЗполнитьТипСтатусаЗаявок(Элементы.СтатусыЗаявок.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗполнитьТипСтатусаЗаявок(СтрТЧ)
	
	Тип = ТипЗнч(СтрТЧ.НачальныйСтатус);
	
	Если Тип = Тип("ПеречислениеСсылка.СтатусыЗаявок") Тогда
		СтрТЧ.ТипСхемыСогласования = "Длинный путь согласования";
	ИначеЕсли Тип = Тип("ПеречислениеСсылка.СтатусыЗаявокСокращенный") Тогда
		СтрТЧ.ТипСхемыСогласования = "Сокраценный путь согласования";
	КонецЕсли;
	
КонецПроцедуры
